// Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел

int A=6;
int B=3;
int C=-2;
int max=A;
if (B>max)max=B;
if (C>max)max=C;
Console.Write("Наибольшее число: ");
Console.Write(max);


